[
    {
        "version": "1.1.1",
        "date": "2023-10-11",
        "description": "build(DIRECTORY-MAPPER): :construction_worker: Windows Installer Change\n\nTesting the Windows Installer",
        "name": "crew-stereotyped"
    },
    {
        "version": "1.1.1",
        "date": "2023-10-11",
        "description": "feat(DIRECTORY-MAPPER): :sparkles: Versionning & Installer Re-Logic\n\nfeat: 🚀 Ajout de fonctionnalités pour le déploiement et la gestion des versions\n\n- Ajout d'un script `deploy.py` pour faciliter le déploiement et la gestion des versions.\n- Intégration de la génération automatique du nom de version.\n- Utilisation dynamique de la version actuelle depuis le fichier `manifest.json`.\n- Ajout de logs et d'emojis pour rendre le script plus informatif et divertissant.\n- Exécution de la commande `git push` avec la branche spécifiée dans `manifest.json` après le déploiement.\n- Windows Installer Rebuild.",
        "name": "constellation-dry"
    },
    {
        "version": "1.2.0",
        "date": "2023-10-11",
        "description": "✨ Implemented modular command-line interface with dedicated commands for 'view', 'create', and 'check-update'.\n🛠 Enhanced and organized command-line options for better user experience.\n📝 Updated README with comprehensive usage instructions and detailed TOC.\n🌐 Translated README to English, maintaining a consistent and user-friendly tone.\n🚀 Added HTML version of the usage section for better web presentation.\n🔄 Refactored and optimized codebase for cleaner and more efficient execution.\n🎨 Added emojis throughout the code and documentation for a more lively and engaging experience.\n🌟 Implemented an update checker script for users to easily check and apply updates.\n📄 Created an HTML version of the README for improved online readability.\n📰 Provided social media-friendly descriptions for better project promotion.\n👾 Handled various user prompts, error messages, and validations for a more user-friendly experience.\n🚢 Prepared the project for deployment with an update checker and installation scripts.\n📚 Generated comprehensive and dynamic TOC for the README.\n🧹 Refactored and reorganized code for better readability and maintainability.\n🔄 Updated the update-checker script to support both Windows and Linux.\n🌈 Improved ASCII art in the directory mapper script.\n💻 Created a deployment script that updates the version in manifest.json, updates version-history.json, and pushes changes to the repository.\n📢 Added a startup ASCII art message in the directory mapper script.\n🔧 Implemented a dynamic approach for specifying colors in ASCII art.\n📥 Enhanced the installation script to include additional dependencies and improve user interaction.\n🎉 Celebrated successful installations with colorful and dynamic messages.\n🔍 Added a check for existing installations in the installation script, allowing users to choose to reinstall.\n🔐 Implemented administrative privilege checks in the Windows installation script.\n💬 Improved and expanded user prompts and messages for clarity and engagement.\n🔄 Enhanced the update-checker script to support multiple platforms and display relevant update instructions.\n🏷 Updated manifest.json with additional information and improved formatting.\n🚨 Addressed issues related to missing parameters and errors in the directory mapper script.\n💄 Added color options and improved formatting for better visual appeal.\n🗃 Organized and optimized codebase for better maintainability and extensibility.\n📋 Generated a complete HTML version of the README with an attractive and structured layout.\n🚀 Created a powerful and flexible command-line tool for managing directory structures.\n🌐 Expanded the project's global reach through translation and language support.\n🌐 Improved the global accessibility of the project by providing an English version of the documentation.\n🤖 Automated version incrementation and update history entry in the deployment script.\n🌐 Globalized the project by providing documentation in multiple languages.\n📚 Documented and showcased various usage scenarios and commands in the README.\n🎨 Beautified and stylized the README with consistent formatting and emojis.\n🔗 Linked relevant sections in the README for easy navigation.\n💼 Provided professional and engaging descriptions for social media promotion.\n🚀 Successfully deployed and promoted the project for widespread adoption.\n🇺🇸 Converted The Whole Project to English for Better understanding world wide.",
        "name": "family-fine"
    },
    {
        "version": "1.2.1",
        "date": "2023-10-12",
        "description": "feat(DIRECTORY-MAPPER): :sparkles: Changed & Improved Create Directory Function\n\n🔨 Further improvements to the create_directory function to handle different types of input, either a JSON file path or a dictionary directly.",
        "name": "raspberry-kaput"
    },
    {
        "version": "1.3.0",
        "date": "2023-10-14",
        "description": "feat: 🚀 Integrate Settings Manager and Menu\n\n- ✨ Added a comprehensive Settings Manager (`settings_manager.py`) for reading, updating, and resetting settings in `settings.json`.\n- 🖌️ Created an interactive Settings Menu (`settings_menu.py`) using `npyscreen` for users to edit and reset various tree builder parameters.\n- 🔄 Updated the `dir_tree_builder` function in `orbit_tree_builder.py` to dynamically fetch styling parameters from the Settings Manager.\n- 📝 Adjusted the structure of the `settings.json` file to include default values for tree builder parameters.\n\nrefactor: 🛠️ Refactor Settings JSON Handling\n\n- 🔄 Refactored the `SettingsForm` class in the Settings Menu to correctly handle attribute assignments, eliminating an `AttributeError`.\n- 🌐 Improved the structure and readability of the code, added logs, emojis, and meaningful comments.",
        "name": "schnitzel-scintillating"
    }
]